mixly/Mixly_Arduino/mixly_arduino/arduino/portable/packages/esp32/hardware/esp32/1.0.4/boards.txt
##############################################################
MixePi.name=Arduino MixePi

MixePi.upload.tool=esptool_py
MixePi.upload.maximum_size=1310720
MixePi.upload.maximum_data_size=327680
MixePi.upload.wait_for_upload_port=true

MixePi.serial.disableDTR=true
MixePi.serial.disableRTS=true

MixePi.build.mcu=esp32
MixePi.build.core=esp32
MixePi.build.variant=MixePi
MixePi.build.board=ESP32_DEV

MixePi.build.f_cpu=240000000L
MixePi.build.flash_size=8MB
MixePi.build.flash_freq=40m
MixePi.build.flash_mode=dio
MixePi.build.boot=dio
MixePi.build.partitions=huge_app
MixePi.build.defines=

MixePi.menu.PSRAM.disabled=Disabled
MixePi.menu.PSRAM.disabled.build.defines=
MixePi.menu.PSRAM.enabled=Enabled
MixePi.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

MixePi.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
MixePi.menu.PartitionScheme.huge_app.build.partitions=huge_app
MixePi.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
MixePi.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
MixePi.menu.PartitionScheme.default.build.partitions=default
MixePi.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
MixePi.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
MixePi.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
MixePi.menu.PartitionScheme.minimal.build.partitions=minimal
MixePi.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
MixePi.menu.PartitionScheme.no_ota.build.partitions=no_ota
MixePi.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
MixePi.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
MixePi.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
MixePi.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
MixePi.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
MixePi.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
MixePi.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
MixePi.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
MixePi.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
MixePi.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
MixePi.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
MixePi.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
MixePi.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
MixePi.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
MixePi.menu.PartitionScheme.fatflash.build.partitions=ffat

MixePi.menu.CPUFreq.240=240MHz (WiFi/BT)
MixePi.menu.CPUFreq.240.build.f_cpu=240000000L
MixePi.menu.CPUFreq.160=160MHz (WiFi/BT)
MixePi.menu.CPUFreq.160.build.f_cpu=160000000L
MixePi.menu.CPUFreq.80=80MHz (WiFi/BT)
MixePi.menu.CPUFreq.80.build.f_cpu=80000000L
MixePi.menu.CPUFreq.40=40MHz (40MHz XTAL)
MixePi.menu.CPUFreq.40.build.f_cpu=40000000L
MixePi.menu.CPUFreq.26=26MHz (26MHz XTAL)
MixePi.menu.CPUFreq.26.build.f_cpu=26000000L
MixePi.menu.CPUFreq.20=20MHz (40MHz XTAL)
MixePi.menu.CPUFreq.20.build.f_cpu=20000000L
MixePi.menu.CPUFreq.13=13MHz (26MHz XTAL)
MixePi.menu.CPUFreq.13.build.f_cpu=13000000L
MixePi.menu.CPUFreq.10=10MHz (40MHz XTAL)
MixePi.menu.CPUFreq.10.build.f_cpu=10000000L

MixePi.menu.FlashMode.qio=QIO
MixePi.menu.FlashMode.qio.build.flash_mode=dio
MixePi.menu.FlashMode.qio.build.boot=qio
MixePi.menu.FlashMode.dio=DIO
MixePi.menu.FlashMode.dio.build.flash_mode=dio
MixePi.menu.FlashMode.dio.build.boot=dio
MixePi.menu.FlashMode.qout=QOUT
MixePi.menu.FlashMode.qout.build.flash_mode=dout
MixePi.menu.FlashMode.qout.build.boot=qout
MixePi.menu.FlashMode.dout=DOUT
MixePi.menu.FlashMode.dout.build.flash_mode=dout
MixePi.menu.FlashMode.dout.build.boot=dout

MixePi.menu.FlashFreq.80=80MHz
MixePi.menu.FlashFreq.80.build.flash_freq=80m
MixePi.menu.FlashFreq.40=40MHz
MixePi.menu.FlashFreq.40.build.flash_freq=40m

MixePi.menu.FlashSize.8M=8MB (64Mb)
MixePi.menu.FlashSize.8M.build.flash_size=8MB
MixePi.menu.FlashSize.4M=4MB (32Mb)
MixePi.menu.FlashSize.4M.build.flash_size=4MB
MixePi.menu.FlashSize.2M=2MB (16Mb)
MixePi.menu.FlashSize.2M.build.flash_size=2MB
MixePi.menu.FlashSize.2M.build.partitions=minimal
MixePi.menu.FlashSize.16M=16MB (128Mb)
MixePi.menu.FlashSize.16M.build.flash_size=16MB
MixePi.menu.FlashSize.16M.build.partitions=ffat

MixePi.menu.UploadSpeed.921600=921600
MixePi.menu.UploadSpeed.921600.upload.speed=921600
MixePi.menu.UploadSpeed.115200=115200
MixePi.menu.UploadSpeed.115200.upload.speed=115200
MixePi.menu.UploadSpeed.256000.windows=256000
MixePi.menu.UploadSpeed.256000.upload.speed=256000
MixePi.menu.UploadSpeed.230400.windows.upload.speed=256000
MixePi.menu.UploadSpeed.230400=230400
MixePi.menu.UploadSpeed.230400.upload.speed=230400
MixePi.menu.UploadSpeed.460800.linux=460800
MixePi.menu.UploadSpeed.460800.macosx=460800
MixePi.menu.UploadSpeed.460800.upload.speed=460800
MixePi.menu.UploadSpeed.512000.windows=512000
MixePi.menu.UploadSpeed.512000.upload.speed=512000

MixePi.menu.DebugLevel.none=None
MixePi.menu.DebugLevel.none.build.code_debug=0
MixePi.menu.DebugLevel.error=Error
MixePi.menu.DebugLevel.error.build.code_debug=1
MixePi.menu.DebugLevel.warn=Warn
MixePi.menu.DebugLevel.warn.build.code_debug=2
MixePi.menu.DebugLevel.info=Info
MixePi.menu.DebugLevel.info.build.code_debug=3
MixePi.menu.DebugLevel.debug=Debug
MixePi.menu.DebugLevel.debug.build.code_debug=4
MixePi.menu.DebugLevel.verbose=Verbose
MixePi.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

m5stack-fire.name=Arduino M5Stack-FIRE

m5stack-fire.upload.tool=esptool_py
m5stack-fire.upload.maximum_size=6553600
m5stack-fire.upload.maximum_data_size=4521984
m5stack-fire.upload.wait_for_upload_port=true

m5stack-fire.serial.disableDTR=true
m5stack-fire.serial.disableRTS=true

m5stack-fire.build.mcu=esp32
m5stack-fire.build.core=esp32
m5stack-fire.build.variant=m5stack_fire
m5stack-fire.build.board=Arduino M5STACK_FIRE

m5stack-fire.build.f_cpu=240000000L
m5stack-fire.build.flash_size=16MB
m5stack-fire.build.flash_freq=80m
m5stack-fire.build.flash_mode=dio
m5stack-fire.build.boot=dio
m5stack-fire.build.partitions=default_16MB
m5stack-fire.build.defines=

m5stack-fire.menu.PSRAM.enabled=Enabled
m5stack-fire.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
m5stack-fire.menu.PSRAM.disabled=Disabled
m5stack-fire.menu.PSRAM.disabled.build.defines=

